content/posts/cloud-native.md
+++
title = "Cloud Native Definition"
date = 2021-07-20T10:55:00+08:00
lastmod = 2021-07-20T10:58:16+08:00
draft = false
+++

> Cloud native technologies empower organizations to build and run scalable
> applications in modern, dynamic environments such as public, private, and hybrid
> clouds. Containers, service meshes, microservices, immutable infrastructure, and
> declarative APIs exemplify this approach.
>
> These techniques enable loosely coupled systems that are resilient, manageable,
> and observable. Combined with robust automation, they allow engineers to make
> high-impact changes frequently and predictably with minimal toil.
>
> The Cloud Native Computing Foundation seeks to drive adoption of this paradigm
> by fostering and sustaining an ecosystem of open source, vendor-neutral
> projects. We democratize state-of-the-art patterns to make these innovations
> accessible for everyone. ([via](https://github.com/cncf/toc/blob/main/DEFINITION.md))


## Containers {#containers}


## Service meshes {#service-meshes}


## Microservices {#microservices}


## Immutable infrastructure {#immutable-infrastructure}


## Declarative APIs {#declarative-apis}
